Tekla Open API Reference for Tekla Structures 2025
FormingStates Class
 FormingStates class which contains different forming options.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Forming.FormingStates
 Namespace: Tekla.Structures.Forming
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class FormingStates : ICloneable
<SerializableAttribute>
Public Class FormingStates
	Implements ICloneable
The FormingStates type exposes the following members.
Constructors
Name | Description
FormingStates()
 Initializes a new instance of the FormingStates class.
FormingStates(DeformingType)
 Initializes a new instance of the FormingStates class.
FormingStates(FoldingType)
 Initializes a new instance of the FormingStates class.
FormingStates(WrappingType)
 Initializes a new instance of the FormingStates class.
FormingStates(DeformingType, FoldingType, WrappingType)
 Initializes a new instance of the FormingStates class.
Top
Properties
Name | Description
Deforming
 Gets or sets the deforming type.
Folding
 Gets or sets the folding type.
Wrapping
 Gets or sets the wrapping type.
Top
Methods
Name | Description
Clone
 Method for cloning the current object.
Top
See Also
Reference
Tekla.Structures.Forming Namespace